In [1]:
#Import Numpy
import numpy as np
#Import pandas
import pandas as pd

In [2]:
#Convert list into series of elements
l = [10,20,30,40,50]
# s1 = pd.Series(data = l, index = ['a','b','c','d','e'])
s1 = pd.Series(data = l)
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
d1  = {"a":10,"b":20,"c":30,"d":40,"e":50}
d1

{'a': 10, 'b': 20, 'c': 30, 'd': 40, 'e': 50}

In [4]:
# print(s1)

In [5]:
type(s1)

pandas.core.series.Series

In [6]:
#Convert dictionaries into series of elements
d = {'a':10,'b':20,'c':30,'d':40,'e':50}
s2 = pd.Series(d)
s2

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [7]:
# print(s2)

In [8]:
# type(s2)

In [7]:
#Addition of two series
ser1=pd.Series([1,2,3,4,5],['India','Srilanka', 'Bangladesh', 'Russia',"england"])
print(ser1)
ser2=pd.Series([1,2,5,9],['India','Srilanka', 'Bangladesh', 'Russia'])
print(ser2)
ser1+ser2

India         1
Srilanka      2
Bangladesh    3
Russia        4
england       5
dtype: int64
India         1
Srilanka      2
Bangladesh    5
Russia        9
dtype: int64

Bangladesh     8.0
India          2.0
Russia        13.0
Srilanka       4.0
england        NaN
dtype: float64

In [8]:
#Create dataframe and select columns
#Syntax - pd.DataFrame(data, index_labels , columns_labels)
df1 = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df1

          W         X         Y         Z
A  2.238551  1.665007  1.031113  0.043045
B -1.458885 -1.429769 -1.351254 -1.716482
C -0.088973  0.586484 -2.789182 -1.678503
D -2.303780 -1.012617 -1.423734 -0.817075
E  1.063327 -0.477620 -0.132376 -1.902974

In [9]:
df1.W['A']

2.2385510854440116

In [10]:
#Accessing one column of the dataframe
df1['W']

A    2.238551
B   -1.458885
C   -0.088973
D   -2.303780
E    1.063327
Name: W, dtype: float64

In [11]:
#Accessing many columns in one go * pay attention that argument is passed as a list of columns names
df1[['W','Z']]

          W         Z
A  2.238551  0.043045
B -1.458885 -1.716482
C -0.088973 -1.678503
D -2.303780 -0.817075
E  1.063327 -1.902974

In [12]:
#Data selection with loc and iloc

#Accessing data with index values - Use loc
print(df1.loc["A"])

#Acdessing the data with row numbers - use iloc
print(df1.iloc[0])

#Access a block through your dataframe OR lets say subset the data
print(df1.loc[['A','C'],['W','Y']])

W    2.238551
X    1.665007
Y    1.031113
Z    0.043045
Name: A, dtype: float64
W    2.238551
X    1.665007
Y    1.031113
Z    0.043045
Name: A, dtype: float64
          W         Y
A  2.238551  1.031113
C -0.088973 -2.789182

In [13]:
#Subsetting based on boolean condition
df1[df1>0]
# df1>0

          W         X         Y         Z
A  2.238551  1.665007  1.031113  0.043045
B       NaN       NaN       NaN       NaN
C       NaN  0.586484       NaN       NaN
D       NaN       NaN       NaN       NaN
E  1.063327       NaN       NaN       NaN

In [14]:
#Dropping rows and columns by drop method
# print(df1.drop('A',axis=0,inplace=False))
# print(df1.drop('W',axis=1,inplace=False))
df1.drop('A',axis=0,inplace=True)
print(df1)

          W         X         Y         Z
B -1.458885 -1.429769 -1.351254 -1.716482
C -0.088973  0.586484 -2.789182 -1.678503
D -2.303780 -1.012617 -1.423734 -0.817075
E  1.063327 -0.477620 -0.132376 -1.902974

In [17]:
# df1['W']

In [15]:
df1

          W         X         Y         Z
B -1.458885 -1.429769 -1.351254 -1.716482
C -0.088973  0.586484 -2.789182 -1.678503
D -2.303780 -1.012617 -1.423734 -0.817075
E  1.063327 -0.477620 -0.132376 -1.902974

In [16]:
#Subsetting plus boolean conditions
df1[df1['W']>0][['X','Y']]

         X         Y
E -0.47762 -0.132376

In [20]:
# df1

In [17]:
#Reset indexing 
df3 = df1.reset_index(drop =True)
df3

          W         X         Y         Z
0 -1.458885 -1.429769 -1.351254 -1.716482
1 -0.088973  0.586484 -2.789182 -1.678503
2 -2.303780 -1.012617 -1.423734 -0.817075
3  1.063327 -0.477620 -0.132376 -1.902974

In [18]:
#setting indexes
df4 = df1.set_index('Z')
df4

                  W         X         Y
Z
-1.716482 -1.458885 -1.429769 -1.351254
-1.678503 -0.088973  0.586484 -2.789182
-0.817075 -2.303780 -1.012617 -1.423734
-1.902974  1.063327 -0.477620 -0.132376

In [19]:
#Dropping missing values
d={'A':[1,2,np.NaN], 'B':[1,np.NaN,np.NaN],'C':[1,2,3]}
# np.NaN is the missing element in DataFrame
df5=pd.DataFrame(d)
print(df5)
# df5.dropna()       #drop any row with missing value
# df5.dropna(axis=1) #drop column with NULL value
df5.dropna(thresh=2) #Require <2 non-NA values to drop row.

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [20]:
#Filling missing values with something
df5['B'].fillna(value=df5['B'].mean())

0    1.0
1    1.0
2    1.0
Name: B, dtype: float64

In [25]:
#Replacing specific values
df5 = pd.DataFrame({'one':[10,20,30,40,50,2000], 'two':[1000,0,30,40,50,60]})
print(df5)
print(df5.replace({1000:10,2000:60}))
print(df5.replace({30:"replaced"}))

    one   two
0    10  1000
1    20     0
2    30    30
3    40    40
4    50    50
5  2000    60
   one  two
0   10   10
1   20    0
2   30   30
3   40   40
4   50   50
5   60   60
        one       two
0        10      1000
1        20         0
2  replaced  replaced
3        40        40
4        50        50
5      2000        60

In [21]:
#Groupby function
data = {'Company': [ 'CompA', 'CompA', 'CompB', 'CompB', 'CompC', 'CompC'],
        'Person': ['Rajesh', 'Pradeep', 'Amit', 'Rakesh', 'Suresh', 'Raj'],
        'Sales': [200, 120, 340, 124, 243, 350]}
df6=pd.DataFrame(data)
print(df6)
comp=df6.groupby("Company")['Sales'].sum() #grouping done using label name “Company”
comp

  Company   Person  Sales
0   CompA   Rajesh    200
1   CompA  Pradeep    120
2   CompB     Amit    340
3   CompB   Rakesh    124
4   CompC   Suresh    243
5   CompC      Raj    350

Company
CompA    320
CompB    464
CompC    593
Name: Sales, dtype: int64

In [22]:
data = {"divisions":["A","B","A","B","C","D"],
       "Students":["sagar","niyas","saroj","tejas","swapnil","xyz"],
       "marks":[70,75,80,85,90,76]}
df_new = pd.DataFrame(data)
print(df_new)
df_new.groupby("divisions")["marks"].sum()

  divisions Students  marks
0         A    sagar     70
1         B    niyas     75
2         A    saroj     80
3         B    tejas     85
4         C  swapnil     90
5         D      xyz     76

divisions
A    150
B    160
C     90
D     76
Name: marks, dtype: int64

In [23]:
#Finding unique value & number of occurrence from Dataframe

df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
print(df)

# col1, col2 & col3 are column labels, each column have their own values
print(df['col2'].unique()) #fetches the unique values available in column

print(df['col2'].value_counts()) # count number of occurance of every value

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz
[444 555 666]
444    2
555    1
666    1
Name: col2, dtype: int64

In [25]:
#File Handling

#Reading from a file
df6 = pd.read_csv("test1.csv")
print(type(df6))

# Writing to a file
df6.to_csv('data9.csv')

# Read a Excel File
# df = pd.read_excel('test2.xlsx')
# df
# Write a Excel File with Single sheet
# df.to_excel('filename_with_path',sheet_name='SheetName')

<class 'pandas.core.frame.DataFrame'>